// Підключаємо express
const express = require("express");

// Створюємо екземпляр нашого сервера
const app = express();
const port = 3000; // Визначаємо порт, на якому буде працювати сервер

// Роут для головної сторінки
app.get("/", (req, res) => {
  res.send("Привіт, світ!");
});

// Роут для сторінки "Про нас"
app.get("/about", (req, res) => {
  res.send("Це сторінка про нас");
});

// Роут для сторінки "Контакти"
app.get("/contact", (req, res) => {
  res.send("Спілкуйтеся з нами тут");
});

// Слухаємо сервер на визначеному порті
app.listen(port, () => {
  console.log(`Сервер запущено на порті ${port}`);
});
